sterentev/atdf-device-asm-include/inc/ATtiny43U.inc
; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Any Logical Change of INTX
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 16
.equ	INT_VECTORS_SIZE	= 0x20
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	WDT		; Watchdog Time-out
;	5	TIM1_COMPA	; Timer/Counter1 Compare Match A
;	6	TIM1_COMPB	; Timer/Counter1 Compare Match B
;	7	TIM1_OVF	; Timer/Counter1 Overflow
;	8	TIM0_COMPA	; Timer/Counter0 Compare Match A
;	9	TIM0_COMPB	; Timer/Counter0 Compare Match B
;	10	TIM0_OVF	; Timer/Counter0 Overflow
;	11	ANA_COMP	; Analog Comparator
;	12	ADC		; ADC Conversion Complete
;	13	EE_RDY		; EEPROM Ready
;	14	USI_START	; USI START
;	15	USI_OVF		; USI Overflow


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; WDT		 - Watchdog Time-out
;#		reti			; TIM1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIM1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIM1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIM0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIM0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	INT_EE_RDY	; EE_RDY	 - EEPROM Ready
;#		reti			; USI_START	 - USI START
;#		reti			; USI_OVF	 - USI Overflow
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY43U_INC_ */

; ************************ END OF FILE *********************************

